--- a/docs/configuration/features/set_features.md
+++ b/docs/configuration/features/set_features.md
@@ -152,12 +147,16 @@ Set features can be used when multi-label classification needs to be performed.
 There is only one decoder available for set features: a (potentially empty) stack of fully connected layers, followed by
 a projection into a vector of size of the number of available classes, followed by a sigmoid.
 
-```
-+--------------+   +---------+   +-----------+
-|Combiner      |   |Fully    |   |Projection |   +-------+
-|Output        +--->Connected+--->into Output+--->Sigmoid|
-|Representation|   |Layers   |   |Space      |   +-------+
-+--------------+   +---------+   +-----------+
+``` mermaid
+graph LR
+  A["Combiner\n Output"] --> B["Fully\n Connected\n Layers"];
+  B --> C["Projection into\n Output Space"];
+  C --> D["Sigmoid"];
+  subgraph DEC["DECODER.."]
+  B
+  C
+  D
+  end
 ```
 
 These are the available parameters of the set output feature
